tests/drop_n500/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     dropletFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.2;

deltaT          2e-4;

writeControl    adjustableRunTime;//timeStep;

writeInterval   0.1;

purgeWrite      3; //0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc  singleGraph
};

libs
(
    "libCarreauArrhenius.so"
);

// ************************************************************************* //
