tests/drop_n500/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    INLET
    {
        type            patch;
        nFaces          30;
        startFace       12360;
    }
    FRONTANDBACK
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12600;
        startFace       12390;
    }
    WALL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          210;
        startFace       24990;
    }
    MOVINGWALL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          210;
        startFace       25200;
    }
    OUTLET
    {
        type            patch;
        nFaces          30;
        startFace       25410;
    }
)

// ************************************************************************* //
