tests/drop_n500/constant/dropletProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0058; // Escudie, 1985

    phaseFrac       phaseFrac [ 0 0 0 0 0 0 0 ] 0.94;

    deltaV	    deltaV [0 3 0 0 0 0 0] 6.54498e-20;

    //zetaB 1.0;
    Cb 1.0;
    Sb 1.0;

    //zetaC 1.0;
    Cc 3.328e-32;
    k  8.0/3.0;
    Sc 1.0;



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
