tests/drop_n500/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "903";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
6300
(
(-2.730253248e-05 -1.236646949e-05 5.66060648e-13)
(9.600122305e-05 -2.281246735e-05 3.281606594e-13)
(0.0003824668492 -2.587286661e-05 4.929707633e-13)
(0.0008462914059 -2.596007201e-05 5.403502829e-13)
(0.001516074546 -2.553422284e-05 4.878088334e-13)
(0.00243203496 -2.525040317e-05 3.543766703e-13)
(0.003645371878 -2.512917397e-05 4.098444075e-13)
(0.005215748449 -2.489224186e-05 4.778084698e-13)
...
)
;

boundaryField
{
    INLET
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
30
(
(-2.730253248e-05 -1.236646949e-05 5.66060648e-13)
(9.600122305e-05 0 0)
(0.0003824668492 0 0)
(0.0008462914059 0 0)
(0.001516074546 0 0)
(0.00243203496 0 0)
(0.003645371878 0 0)
(0.005215748449 0 0)
...
)
;
    }
    FRONTANDBACK
    {
        type            empty;
    }
    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    MOVINGWALL
    {
        type            fixedValue;
        value           uniform (0.309 0 0);
    }
    OUTLET
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
