tests/drop_n500/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "903";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6300
(
3.397010509
3.693032125
3.885060143
4.135188979
4.487628154
4.883738359
5.270878562
5.620931716
...
)
;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 0;
    }
    FRONTANDBACK
    {
        type            empty;
    }
    WALL
    {
        type            zeroGradient;
    }
    MOVINGWALL
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
