tests/drop_n500/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "903";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
6300
(
481.3945603
473.2346751
469.3012704
467.3235517
466.3951843
466.0198101
465.8950151
465.8617763
...
)
;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 465.85;
    }
    FRONTANDBACK
    {
        type            empty;
    }
    WALL
    {
        type            fixedValue;
        value           uniform 493.15;
    }
    MOVINGWALL
    {
        type            fixedValue;
        value           uniform 493.15;
    }
    OUTLET
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
