tests/drop_n500/0/alpha
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6300
(
0.156792
0.102497
0.0909284
0.0880502
0.0871089
0.0858647
0.0839277
0.0814635
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.0389679
0.00978235
0.00169283
0.00274228
0.00131874
0.000197079
0.00117596
0.00167735
...
)
;
    }
    FRONTANDBACK
    {
        type            empty;
    }
    WALL
    {
        type            calculated;
        value           nonuniform List<scalar> 
210
(
0.129496
0.277334
0.332322
0.340128
0.343748
0.346376
0.348276
0.349955
...
)
;
    }
    MOVINGWALL
    {
        type            calculated;
        value           nonuniform List<scalar> 
210
(
0.00339376
0.00335265
0.00263683
0.00329607
0.00359311
0.0038035
0.00398905
0.00414248
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.000183553
0.000242447
0.000236266
0.000119959
3.77998e-05
0.000175443
0.00025922
0.000286411
...
)
;
    }
}


// ************************************************************************* //
