tests/drop_n500/0/shearrate
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      shearrate;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6300
(
6.1956
13.9389
23.082
34.5777
49.2951
67.8054
90.4127
117.271
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
5.92477
13.2446
22.1837
33.6049
48.278
66.7126
89.1917
115.873
...
)
;
    }
    FRONTANDBACK
    {
        type            empty;
    }
    WALL
    {
        type            calculated;
        value           nonuniform List<scalar> 
210
(
2.9375
6.63203
8.54646
10.7468
13.2751
16.0777
19.2069
22.6963
...
)
;
    }
    MOVINGWALL
    {
        type            calculated;
        value           nonuniform List<scalar> 
210
(
3659.58
3651.34
3662.6
3668.89
3673.6
3677.77
3681.25
3684.14
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
2223.81
2037.97
1841.86
1660.94
1516.15
1414.66
1351.91
1317.6
...
)
;
    }
}


// ************************************************************************* //
