tests/drop_n500/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(N01|N02|N03|N04|N05)" //|N06|N07|N08|N09|N10|N11|N12|N13|N14|N15|N16|N17|N18|N19|N20)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    N01Final{
        $N01;
        relTol 0;
    }
    N02Final{
        $N02;
        relTol 0;
    }
    N03Final{
        $N03;
        relTol 0;
    }
    N04Final{
        $N04;
        relTol 0;
    }
    N05Final{
        $N05;
        relTol 0;
    }
}
PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
